In [1]:
import pandas as pd

In [6]:
pd.DataFrame({"A":[1,2],"B":[3,4]}, index=[1,2])

   A  B
1  1  3
2  2  4

In [12]:
pd.DataFrame({"A":[1,2],"B":[3,4],"C":[5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [15]:
pd.DataFrame([[4,7,10],[1,2,3]], index=[1,2], columns=['A','B','C'])

   A  B   C
1  4  7  10
2  1  2   3

In [19]:
pd.DataFrame([[1,2,3],[5,6,7],[1,2,4],[1,4,8]], index=range(1,5), columns=['A','B','C'])

   A  B  C
1  1  2  3
2  5  6  7
3  1  2  4
4  1  4  8

In [23]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object